# Задание 153
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) Затем справа дописываются два разряда: символы 01, если число N чётное, и 10, если нечётное.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
n = int(input()) # набираем символы на клавиатуре
r = bin(n) # переводим в двоичную систему счисления
print(r) # выводим результат

```
## В ответе получаем (написать число '50') 0b110010 


```
n = int(input()) # набираем символы на клавиатуре
r = bin(n)[2:] # переводим в двоичную систему счисления пропуская первые 2 символа
print(r) # выводим результат
if n % 2 == 0: # если число чётное
    r += '01' # добавляем в конец строки '01'
else:  # иначе (число нечётное)
    r += '10'  # добавляем в конец строки '10'
print(r) # выводим результат

```
## В ответе получаем (написать число '50') 110010 11001001

```
for n in range(1, 100):
    r = bin(n)[2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    print(n, r)
```
## В ответе слишком много чисел они в двоичном виде
